Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаУстаревший</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяДолжностьРуководителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийКассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПаспортист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяКонтрагентовДляСубсидийИЛьгот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентЛьгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентСубсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорЛьгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорСубсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентРегиональнаяСубсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорРегиональнаяСубсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/БанковскиеСчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Процедура заполняет значения полей "МФО" и "КоррСчет".
//
Процедура ЗаполнитьМФОиКоррСчет(Банк, МФО, КоррСчет)

	Если НЕ ЗначениеЗаполнено(Банк) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Код КАК МФО,
	|	КоррСчет
	|ИЗ
	|	Справочник.Банки КАК Банки
	|ГДЕ
	|	Банки.Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", Банк);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		МФО = Выборка.МФО;
		КоррСчет = Выборка.КоррСчет;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьМФОиКоррСчет()

&НаСервере
// Процедура заполняет значения поля "ТекстКорреспондента".
//
Процедура ЗаполнитьТекстКорреспондента()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Владелец);
		
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Организации") Тогда
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.НаименованиеПолное
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Ссылка";
				
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.НаименованиеПолное
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Ссылка";
			
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстКорреспондента = СокрЛП(Выборка.НаименованиеПолное);
	КонецЕсли;

КонецПроцедуры // ЗаполнитьТекстКорреспондента()

&НаСервере
// Процедура выводит сообщение пользователю, если не найден банк.
//
Процедура СообщитьЧтоБанкНеНайден(Поле, Значение)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;

	Текст = "Банк с" + 
		?(Найти(Поле, "МФО") <> 0, " МФО " + Значение, "") +
		?(Найти(Поле, "КоррСчет") <> 0, " Корр.счетом " + Значение, "") +
		" не найден в классификаторе банков.";
		
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Текст;
	Сообщение.Поле = Поле;
	Сообщение.УстановитьДанные(Объект);
	Сообщение.Сообщить();
	
КонецПроцедуры // СообщитьЧтоБанкНеНайден()

&НаСервере
// Функция получает таблицу ссылок на банки по МФО или корреспондетскому счету.
//
// Параметры:
//	Поле - Строка - Имя поля (МФО или КоррСчет)
//	Значение - Строка - Значение МФО или Корреспондентского счета
//
// Возвращаемое значение:
//	ТаблицаЗначений - Найденые банки
//
Функция ПолучитьТаблицуБанковПоРеквизитам(Поле, Значение)
	
	ТаблицаБанков = Новый ТаблицаЗначений;
	Колонки = ТаблицаБанков.Колонки;
	Колонки.Добавить("Ссылка");
	Колонки.Добавить("Код");
	Колонки.Добавить("КоррСчет");
	
	ЭтоМФО = Найти(Поле, "МФО") <> 0;
	ЭтоКоррСчет = Найти(Поле, "КоррСчет") <> 0;
	
	Если Не ЭтоМФО
	   И Не ЭтоКоррСчет
	Тогда
		Возврат ТаблицаБанков;
	КонецЕсли;
	
	Если (ЭтоМФО И СтрДлина(Значение) < 6)
	 ИЛИ (ЭтоКоррСчет <> 0 И СтрДлина(Значение) < 20)
	Тогда
		Возврат ТаблицаБанков;
	КонецЕсли;
	
	Если ЭтоМФО Тогда
		СтруктураОтбора = Новый Структура("Код", Значение);
		
	ИначеЕсли ЭтоКоррСчет Тогда
		СтруктураОтбора = Новый Структура("КоррСчет", Значение);
		
	КонецЕсли;
	
	Выборка = Справочники.Банки.Выбрать(,, СтруктураОтбора, "Код Возр");
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаБанков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Возврат ТаблицаБанков;
	
КонецФункции // ПолучитьТаблицуБанковПоРеквизитам()

&НаСервере
// Процедура получает банк по указанному МФО или корреспондентскому счету.
//
// Параметры:
//	Поле - Строка - Имя поля, в котором произведен выбор значения.
//	Значение - Строка - Значение, выбранное в поле.
//	Банк - СправочникСсылка.Банки - Значение поля для указания банка
//	МФО - Строка - МФО банка
//	КоррСчет - Строка - Корреспондентский счет банка
//
// Возвращаемое значение:
//	СписокЗначений - Список банков для интерактивного выбора.
//
Функция ПолучитьБанкПоРеквизитамСервер(Поле, Значение, Банк, МФО, КоррСчет)

	СписокБанков = Новый СписокЗначений;
	
	// Если значение не выбрано, очистим значение банка.
	Если ПустаяСтрока(Значение) Тогда
	
		Банк = Справочники.Банки.ПустаяСсылка();
		МФО = "";
		КоррСчет = "";
		
		Возврат СписокБанков;
		
	КонецЕсли;
	
	ТаблицаБанков = ПолучитьТаблицуБанковПоРеквизитам(Поле, Значение);
	Если ТаблицаБанков.Количество() = 0 Тогда
		СообщитьЧтоБанкНеНайден(Поле, Значение);
	ИначеЕсли ТаблицаБанков.Количество() = 1 Тогда
		ДанныеБанка = ТаблицаБанков[0];
		
		Банк = ДанныеБанка.Ссылка;
		МФО = ДанныеБанка.Код;
		КоррСчет = ДанныеБанка.КоррСчет;
		
	Иначе
		МассивБанков = ТаблицаБанков.ВыгрузитьКолонку("Ссылка");
		СписокБанков.ЗагрузитьЗначения(МассивБанков);
		
	КонецЕсли;
	
	Возврат СписокБанков;
	
КонецФункции // ПолучитьБанкПоРеквизитамСервер()

&НаКлиенте
// Процедура получает банк по указанному МФО или корреспондентскому счету.
//
// Параметры:
//	Элемент - ПолеУправляемойФормы - Поле, в котором произведен выбор значения.
//	Значение - Строка - Значение, выбранное в поле.
//	Банк - СправочникСсылка.Банки - Значение поля для указания банка
//	МФО - Строка - МФО банка
//	КоррСчет - Строка - Корреспондентский счет банка
//
Процедура ПолучитьБанкПоРеквизитам(Элемент, Значение, Банк, МФО, КоррСчет)

	СписокБанков = ПолучитьБанкПоРеквизитамСервер(Элемент.Имя, Значение, Банк, МФО, КоррСчет);

	// Если возвращен список банков, произведем выбор банка из списка.
	Если СписокБанков.Количество() > 1 Тогда
	
		ВыбранныйЭлемент = ВыбратьИзСписка(СписокБанков, Элемент);
		Если ВыбранныйЭлемент <> Неопределено Тогда
			Банк = ВыбранныйЭлемент.Значение;
			ЗаполнитьМФОиКоррСчет(Банк, МФО, КоррСчет);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры // ПолучитьБанкПоРеквизитам()

&НаСервере
// Процедура управления элементами формы.
//
Процедура УправлениеЭлементамиФормы()

	// Установим использование банка для расчетов.
	ИспользуетсяБанкРасчетов = ЗначениеЗаполнено(Объект.БанкРасчетов);
	
	Если ИспользуетсяБанкРасчетов Тогда
		Элементы.ГруппаСтраницыНепрямыеРасчеты.ТекущаяСтраница = Элементы.ГруппаБанкРасчетов;
	Иначе	
		Элементы.ГруппаСтраницыНепрямыеРасчеты.ТекущаяСтраница = Элементы.ГруппаНадписьНепрямыеРасчеты;
	КонецЕсли;
		
	// Установим редактирования текста наименования орагнизации.
	РедактироватьТекстКорреспондента = ЗначениеЗаполнено(Объект.ТекстКорреспондента);
	Элементы.ТекстПлательщика.Доступность = РедактироватьТекстКорреспондента;
	Элементы.ТекстПолучателя.Доступность = РедактироватьТекстКорреспондента;
	
	Если РедактироватьТекстКорреспондента Тогда
		ТекстКорреспондента = Объект.ТекстКорреспондента;
	Иначе
		ЗаполнитьТекстКорреспондента();
	КонецЕсли;
  	
	// Установим текущую закладку.
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Организации") Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРеквизитыСчетаОрганизации;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРеквизитыСчетаКонтрагента;
	КонецЕсли;

КонецПроцедуры // УправлениеЭлементамиФормы()

&НаКлиенте
// Функция формирует наименование банковского счета.
//
Функция СформироватьАвтоНаименование()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	СтрокаНаименования = СокрЛп(Объект.НомерСчета) + ?(ЗначениеЗаполнено(Объект.Банк), ", в " + Строка(Объект.Банк), "");
	СтрокаНаименования = Лев(СтрокаНаименования, 100);
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	СтрокаНаименования = ?(ЗначениеЗаполнено(Объект.Банк), Строка(Объект.Банк), "") + " (" + Строка(Объект.ВалютаДенежныхСредств) + ")";
	СтрокаНаименования = Лев(СтрокаНаименования, 100);
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	Возврат СтрокаНаименования;

КонецФункции // СформироватьАвтоНаименование()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы ПриСозданииНаСервере.
// В процедуре осуществляется установка видимости и доступности элементов
// формы в зависимости от типа владельца.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполним МФО и кор.счет банка.
	ЗаполнитьМФОиКоррСчет(Объект.Банк, МФОБанка, КоррСчетБанка);
	
	// Заполним МФО и кор.счет банка для расчетов.
	ЗаполнитьМФОиКоррСчет(Объект.БанкРасчетов, МФОБанкаДляРасчетов, КоррСчетБанкаДляРасчетов);
	
	УправлениеЭлементамиФормы();
	
    НепрямыеРасчетыНадпись = НСтр("ru='Установите флажок ""Используется банк для расчетов"", если банк, в котором открыт счет, проводит "
"расчеты через корреспондентский счет, открытый в другом банке (банке для расчетов)."
"В платежных поручениях ""Банк получателя"" будет указываться банк для расчетов,"
"а номер счета и наименование банка, в котором открыт счет, будут выводиться в поле ""Получатель"".';uk='Установите флажок ""Используется банк для расчетов"", если банк, в котором открыт счет, проводит "
"расчеты через корреспондентский счет, открытый в другом банке (банке для расчетов)."
"В платежных поручениях ""Банк получателя"" будет указываться банк для расчетов,"
"а номер счета и наименование банка, в котором открыт счет, будут выводиться в поле ""Получатель"".'"
	);
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Процедура - обработчик события "ПередЗаписью" формы.
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	// Если выключено использование банка для расчетов, очистим значение банка.
	Если НЕ ИспользуетсяБанкРасчетов
	   И ЗначениеЗаполнено(Объект.БанкРасчетов)
	Тогда
		Объект.БанкРасчетов = Неопределено;
	КонецЕсли; 
	
	// Заполним текст корреспондента.
	Если РедактироватьТекстКорреспондента Тогда
		Объект.ТекстКорреспондента = ТекстКорреспондента;
	Иначе
		Объект.ТекстКорреспондента = "";
	КонецЕсли;  
	
КонецПроцедуры // ПередЗаписью()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "МФОБанка".
//
Процедура МФОБанкаПриИзменении(Элемент)

	ПолучитьБанкПоРеквизитам(Элемент, МФОБанка, Объект.Банк, МФОБанка, КоррСчетБанка);
	
КонецПроцедуры // МФОБанкаПриИзменении()

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля "МФОБанка".
//
Процедура МФОБанкаНачалоВыбора(Элемент,  ДанныеВыбора, СтандартнаяОбработка)

	ОткрытьФорму("Справочник.Банки.ФормаВыбора", , Элемент);
	
КонецПроцедуры // МФОБанкаНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события "ОбработкаВыбора" поля "МФОБанка".
//
Процедура МФОБанкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ЗаполнитьМФОиКоррСчет(ВыбранноеЗначение, МФОБанка, КоррСчетБанка);
	Объект.Банк = ВыбранноеЗначение;
	
КонецПроцедуры // МФОБанкаОбработкаВыбора()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "КоррСчетБанка".
//
Процедура КоррСчетБанкаПриИзменении(Элемент)

	ПолучитьБанкПоРеквизитам(Элемент, КоррСчетБанка, Объект.Банк, МФОБанка, КоррСчетБанка);
	
КонецПроцедуры // КоррСчетБанкаПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" флажка "ИспользуетсяБанкРасчетов".
//
Процедура ИспользуетсяБанкРасчетовПриИзменении(Элемент)

	Если ИспользуетсяБанкРасчетов Тогда
		Элементы.ГруппаСтраницыНепрямыеРасчеты.ТекущаяСтраница = Элементы.ГруппаБанкРасчетов;
	Иначе	
		Элементы.ГруппаСтраницыНепрямыеРасчеты.ТекущаяСтраница = Элементы.ГруппаНадписьНепрямыеРасчеты;
	КонецЕсли;
	
КонецПроцедуры // ИспользуетсяБанкРасчетовПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "МФОБанкаДляРасчетов".
//
Процедура МФОБанкаДляРасчетовПриИзменении(Элемент)

	ПолучитьБанкПоРеквизитам(Элемент, МФОБанкаДляРасчетов, Объект.БанкРасчетов, МФОБанкаДляРасчетов, КоррСчетБанкаДляРасчетов);
	
КонецПроцедуры // МФОБанкаДляРасчетовПриИзменении()

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля "МФОБанка".
//
Процедура МФОБанкаДляРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ОткрытьФорму("Справочник.Банки.ФормаВыбора", , Элемент);
	
КонецПроцедуры // МФОБанкаДляРасчетовНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля "МФОБанкаДляРасчетов".
//
Процедура МФОБанкаДляРасчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ЗаполнитьМФОиКоррСчет(ВыбранноеЗначение, МФОБанкаДляРасчетов, КоррСчетБанкаДляРасчетов);
	Объект.БанкРасчетов = ВыбранноеЗначение;
	
КонецПроцедуры // МФОБанкаДляРасчетовОбработкаВыбора()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "КоррСчетБанкаДляРасчетов".
//
Процедура КоррСчетБанкаДляРасчетовПриИзменении(Элемент)

	ПолучитьБанкПоРеквизитам(Элемент, КоррСчетБанкаДляРасчетов, Объект.БанкРасчетов, МФОБанкаДляРасчетов, КоррСчетБанкаДляРасчетов);
	
КонецПроцедуры // КоррСчетБанкаДляРасчетовПриИзменении()

&НаКлиенте  
// Процедура - обработчик события "ПриИзменении" флажка "РедактироватьТекстПлательщика".
//
Процедура РедактироватьТекстПлательщикаПриИзменении(Элемент)
	
	Элементы.ТекстПлательщика.Доступность = РедактироватьТекстКорреспондента;
	
	Если НЕ РедактироватьТекстКорреспондента Тогда
		ЗаполнитьТекстКорреспондента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" флажка "РедактироватьТекстПолучателя".
//
Процедура РедактироватьТекстПолучателяПриИзменении(Элемент)
	
	Элементы.ТекстПолучателя.Доступность = РедактироватьТекстКорреспондента;
	
	Если НЕ РедактироватьТекстКорреспондента Тогда
		ЗаполнитьТекстКорреспондента();		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбораИзСписка" поля "Наименование".
//
Процедура НаименованиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СформироватьАвтоНаименование();
	ВыбранныйЭлемент = ВыбратьИзСписка(Элементы.Наименование.СписокВыбора, Элемент);
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.Наименование = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
КонецПроцедуры // НаименованиеНачалоВыбораИзСписка()

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	
	Объект.НомерСчета = СокрЛП(Объект.НомерСчета);
	
	Если Не ПустаяСтрока(Объект.НомерСчета) Тогда
		НомерСчетаПриИзмененииСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НомерСчетаПриИзмененииСервер()
		
	Если НЕ Объект.Ссылка.Пустая()
		И НЕ ЗначениеЗаполнено(Объект.Ссылка.НомерСчетаУстаревший)
		И Объект.НомерСчета <> Объект.Ссылка.НомерСчета
		И ПечатьКвитанцииНаОплату2.НомерБанковскогоСчетаСоответствуетСтандартуIBAN(Объект.НомерСчета)
		И НЕ ПечатьКвитанцииНаОплату2.НомерБанковскогоСчетаСоответствуетСтандартуIBAN(Объект.Ссылка.НомерСчета) Тогда
		
		Объект.НомерСчетаУстаревший = Объект.Ссылка.НомерСчета;
		
	КонецЕсли;
	
	БанкПоСчету = ПечатьКвитанцииНаОплату2.ПолучитьБанкПоНомеруСчетаIBAN(Объект.НомерСчета);
	Если ЗначениеЗаполнено(БанкПоСчету) Тогда
		Объект.Банк = БанкПоСчету;
	КонецЕсли;
	
КонецПроцедуры
